{"basics":{"name":"Sailesh Dwivedy","label":"Master's Student in Computer Science","email":"sadw2186@colorado.edu","phone":"+1-650-476-5385","url":"https://github.com/saileshdwivedy30","summary":"Motivated Computer Science graduate with a 4.0 GPA, specializing in AI, Machine Learning, Natural Language Processing, AWS and GCP. I have gained extensive experiences in research, demonstrating improvements in model accuracy and efficiency along with implementation and deployment of cutting-edge ML solutions.","location":{"address":"1475 Folsom St","postalCode":"80302","city":"Boulder","countryCode":"US","region":"Colorado"},"profiles":[{"network":"LinkedIn","username":"SaileshDwivedy","url":"https://www.linkedin.com/in/saileshdwivedy/"},{"network":"GitHub","username":"saileshdwivedy30","url":"https://github.com/saileshdwivedy30"}]},"education":[{"institution":"University of Colorado, Boulder","studyType":"Master's in Computer Science (Research Track)","startDate":"2023-08","endDate":"2025-05","score":"4.0/4.0"},{"institution":"Kalinga Institute of Industrial Technology","studyType":"Bachelor's Computer Science and Engineering","startDate":"2016-05","endDate":"2020-05","score":"3.6/4.0"}],"projects":[{"name":"Research Project: Knowledge Distillation Optimization (Submitted to CVPR 2025)","advisor":"Advisor: Prof. Danna Gurari and PhD Nick Cooper [2024]","description":"Mapping Layers by Functional Roles Enhances Knowledge Distillation Performance.","highlights":["We developed a novel layer selection strategy for Feature Knowledge Distillation (FKD) by analyzing the functional roles of layers to optimize teacher-student model alignment.","Improved accuracy by up to 15% over SOTA methods and increased training efficiency by 80%, using datasets CIFAR-10, CIFAR-100, Tiny ImageNet, and vision model architectures like VGG, ResNet, Transformers."]},{"name":"Research Project: Distributed DL Training Cost Prediction","advisor":"Advisor: Prof. Eric Keller and PhD Maziyar Nazari [2024]","description":"Training Cost Prediction based on Model Resource Usage. (Ongoing)","highlights":["Designing a data-driven framework to predict training costs for distributed deep learning models on Vertex AI.","Collecting and curating data on key parameters, including model hyperparameters, resource usage (CPU, GPU, memory, disk, network), instance configurations, and training cost.","Preparing for model development by identifying relevant features and experimenting with regression models (e.g., Random Forest, XGBoost) to uncover patterns in resource utilization and optimize cost predictions."]},{"name":"Project: Slurred Speech (Dysarthria) Detection System","description":"Detection of speech impairments using Machine Learning and NLP techniques. (Ongoing)","highlights":["Utilized the Torgo dataset to develop a system for detecting slurred speech (dysarthria) for medical diagnostics.","Achieved a 93% accuracy with classical machine learning models (Random Forest, LightGBM) and obtained promising classification results: Precision: 93%, Recall: 91%, F1-Score: 92% (macro average).","Currently building an NLP-based model leveraging ASR transcriptions and transformer-based models, such as BERT, to better capture nuanced speech impairments."]}],"work":[{"name":"University of Colorado, Boulder","position":"Research Assistant, Image and Video Computing Lab","url":"https://www.colorado.edu/","startDate":"2024-08","endDate":"Present","summary":"Worked on Knowledge Distillation in Computer Vision.","highlights":["Continued my work on enhancing performance by 15% over state-of-the-art methods and increased training efficiency by 80%."]},{"name":"University of Colorado, Boulder","position":"Summer Research Intern, Image and Video Computing Lab","url":"https://www.colorado.edu/","startDate":"2024-05","endDate":"2024-08","summary":"Worked on Knowledge Distillation in Computer Vision.","highlights":["Used data-driven techniques to enhance performance by 15% over."]},{"name":"Kalinga Institute of Industrial Technology","position":"Research Associate","url":"https://kiit.ac.in/","startDate":"2023-02","endDate":"2023-08","summary":"Worked with Prof. Suresh Satapathy on imbalanced classification techniques.","highlights":["Researched SMOTE, sampling, and Tomek Links for imbalanced classification problems."]},{"name":"Highradius Technologies Private Limited","position":"Data Science Team Lead","url":"https://www.highradius.com/","startDate":"2020-09","endDate":"2023-02","summary":"Led a team of 10 in implementing and deploying ML models for enterprise clients.","highlights":["Designed and deployed Smart Email Composer, using techniques of Information Extraction like Event Extraction and NER combined with Generative AI to classify events and extract key entities from emails, enabling tailored email responses and enhancing account workflows.","Owned end-to-end deployment of the AI solution, reducing response time by 40%, delivering business impact.","Developed imbalance classification financial models for Deduction Validity Predictor for Fortune 500 clients with 90% accuracy, cutting research time by 25% and boosting dollar amount recovery by 12%.","Developed ML models for regression use case of Payment Date Prediction, cutting Days Sales Outstanding by 30%.","Automated the ML pipeline leading to 33% deployment timeline reduction resulting in faster value realization.","Led a team of 10 on advanced analytics projects, driving innovation through collaboration with cross-functional teams.","Leveraged strong communication skills presenting actionable insights to stakeholders for data-informed decision-making."]}],"skills":[{"name":"Programming and Libraries","keywords":["Python","PyTorch","SQL","Numpy","Pandas"]},{"name":"Data Visualization","keywords":["Seaborn","Plotly","Matplotlib"]},{"name":"Data Science","keywords":["Statistics","Data Preprocessing","Classification","Regression","Ensemble Methods"]},{"name":"Machine Learning","keywords":["Scikit-Learn","Random Forest","XGBoost","Neural Networks"]},{"name":"NLP","keywords":["Transformers","NER","Sentiment Analysis","Prompt Engineering"]},{"name":"Computer Vision","keywords":["Stable Diffusion","YOLO","CNN","Vision Transformers","ResNet","Knowledge Distillation"]},{"name":"MLOps and Cloud","keywords":["Docker","Kubernetes","MLflow","Vertex AI"]}],"certificates":[{"name":"Generative AI with Large Language Models","date":"2024-09","issuer":"Deep Learning.AI and Amazon Web Services"},{"name":"Oracle Cloud Infrastructure 2024 Generative AI Certified Professional","date":"2024-08","issuer":"Oracle"}],"awards":[{"title":"Best Performer of the Team","date":"2020-05","awarder":"Highradius Technologies"},{"title":"Winner at Smart India Hackathon 2019","date":"2019-03","awarder":"Government of India"}]}